### Import packages

In [72]:
import sqlite3
import pandas as pd

### Connect to database

In [73]:
conn = sqlite3.connect('amazon_.db')
c = conn.cursor()

In [79]:
c.execute("""SELECT * FROM books
LIMIT 5; """) 
booksdf = pd.DataFrame(c.fetchall())
booksdf.columns = [i[0] for i in c.description]
booksdf.head()

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [83]:
c.execute("""SELECT * FROM author; """) 
authorsdf = pd.DataFrame(c.fetchall())
authorsdf.columns = [i[0] for i in c.description]
authorsdf.head()

             author                                book
0      David Taylor         A Guy Dove Outside The Desk
1    Sidney Osborne        A Fish Hopped Through A Lake
2     Robert Martin     The Woman Winced Outside A Desk
3      Greg Simpson  A Banana Winced Outside The Banana
4  Edgar Williamson      A Person Ate Behind The Potato

In [93]:
c.execute("""SELECT Count(DISTINCT author) FROM author; """) 
booksdf = pd.DataFrame(c.fetchall())
booksdf.columns = [i[0] for i in c.description]
booksdf

   Count(DISTINCT author)
0                  172559

In [82]:
c.execute("""SELECT Count(*) FROM books; """) 
booksdf = pd.DataFrame(c.fetchall())
booksdf.columns = [i[0] for i in c.description]
booksdf

   Count(*)
0     80000

### Questions

1. How many rows are in the author and books tables?

2. How many authors (share) didn't sell some of their book? 

3. How many duplicates are there in the author table?   

4. How many authors (share) didn't sell any book?

5. Return the names of these authors.

6. How many books in total each author has sold? 

7. Choose only authors who have sold more than 400K copies
    - use subquery first
    - can you use something else? 

8. Get all authors that have their name starting with 'a'
    - Use substr first
    - Can you use a wild card? 

9. Count the number of authors that have their name starting with 'a' and that have single books that
    sold more than 200K copis
    - Can you use WITH

In [92]:

c.execute("""SELECT author FROM author a LEFT JOIN books b ON a.book=b.books;""") 
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

             author
0      David Taylor
1    Sidney Osborne
2     Robert Martin
3      Greg Simpson
4  Edgar Williamson

In [100]:
c.execute("""(SELECT book FROM books) - (SELECT author FROM author a LEFT JOIN books b ON a.book=b.books;); """) 
authorsdf = pd.DataFrame(c.fetchall())
authorsdf.columns = [i[0] for i in c.description]
authorsdf.head()

OperationalError: near "(": syntax error

In [ ]:
c.execute("""SELECT author FROM author a LEFT JOIN books b ON a.book=b.books;""") 
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

In [ ]:
SELECT author FROM author a LEFT JOIN books b ON a.book=b.books;